C_paper/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C言語 筆記試験</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../style1.css" />
</head>
<body>
<div id="content">
<h1 class="title">C言語 筆記試験</h1>

<div id="outline-container-org3a99bcd" class="outline-2">
<h2 id="org3a99bcd">問1</h2>
<div class="outline-text-2" id="text-org3a99bcd">
<p>
グローバル変数とローカル変数の違いについて述べよ<br />
</p>
</div>
</div>

<div id="outline-container-org5993aa1" class="outline-2">
<h2 id="org5993aa1">問2</h2>
<div class="outline-text-2" id="text-org5993aa1">
<p>
プリプロセッサの#includeと#defineについて説明せよ<br />
</p>
</div>
</div>

<div id="outline-container-org3b0e85f" class="outline-2">
<h2 id="org3b0e85f">問3</h2>
<div class="outline-text-2" id="text-org3b0e85f">
<p>
int、char、long、short、float、double型についてそれぞれ説明せよ<br />
</p>
</div>
</div>

<div id="outline-container-org1aae17f" class="outline-2">
<h2 id="org1aae17f">問4</h2>
<div class="outline-text-2" id="text-org1aae17f">
<p>
以下のプログラムを作成せよ<br />
</p>
<ol class="org-ol">
<li>1～100までの整数のうち3の倍数が入った配列を作成する<br /></li>
<li>1～100までの整数のうち4の倍数が入った配列を作成する<br /></li>
<li>1.と2.両方に入っている値のみで配列を作成する<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orgc5cb750" class="outline-2">
<h2 id="orgc5cb750">問5</h2>
<div class="outline-text-2" id="text-orgc5cb750">
<p>
以下のプログラムの、main関数終了時点でのa、b、c、*c、d、*dの値を答えよ<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="linenr">1: </span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">void</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
<span class="linenr">2: </span>    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span> = <span style="color: #a45bad;">0</span>;
<span class="linenr">3: </span>    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">b</span> = a;
<span class="linenr">4: </span>    <span style="color: #ce537a; font-weight: bold;">int</span>* <span style="color: #7590db;">c</span> = &amp;a;
<span class="linenr">5: </span>    <span style="color: #ce537a; font-weight: bold;">int</span>* <span style="color: #7590db;">d</span>;
<span class="linenr">6: </span>    a = <span style="color: #a45bad;">5</span>;
<span class="linenr">7: </span>
<span class="linenr">8: </span>    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span class="linenr">9: </span><span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdfeb87f" class="outline-2">
<h2 id="orgdfeb87f">問6</h2>
<div class="outline-text-2" id="text-orgdfeb87f">
<p>
   下記のプログラムについて以下の問いに答えよ<br />
（１）コンパイルエラーを修正せよ<br />
（２）main関数の最終行時点でのapple、pen、pineapple、applePen、pineapplePenの値を答えよ<br />
（３）プログラム実行後にコンソールに表示される文字列を記述せよ<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">apple</span>;
<span class="linenr"> 2: </span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">pen</span>;
<span class="linenr"> 3: </span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">pineapple</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
<span class="linenr"> 6: </span>    apple = <span style="color: #a45bad;">0x01</span> &lt;&lt; <span style="color: #a45bad;">4</span>;
<span class="linenr"> 7: </span>    pen = <span style="color: #a45bad;">0x20</span> &gt;&gt; <span style="color: #a45bad;">2</span>;
<span class="linenr"> 8: </span>    pineapple = <span style="color: #a45bad;">0x40</span> &gt;&gt; <span style="color: #a45bad;">4</span>;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">applePen</span> = apple | pen;
<span class="linenr">11: </span>    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">pineapplePen</span> = pineapple | pen;
<span class="linenr">12: </span>
<span class="linenr">13: </span>    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"HasApple(applePen) = %d\n"</span>, HasApple<span style="color: #2d9574;">(</span>applePen<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
<span class="linenr">14: </span>    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"HasAppleOrPineapple(pineapplePen) = %d\n"</span>, HasAppleOrPineapple<span style="color: #2d9574;">(</span>pineapplePen<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
<span class="linenr">15: </span>    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"HasAppleOrPineapple(0x06) = %d\n"</span>, HasAppleOrPineapple<span style="color: #2d9574;">(</span><span style="color: #a45bad;">0x06</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
<span class="linenr">16: </span>
<span class="linenr">17: </span>    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span class="linenr">18: </span><span style="color: #4f97d7;">}</span>
<span class="linenr">19: </span>
<span class="linenr">20: </span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">HasApple</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">value</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
<span class="linenr">21: </span>    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>value &amp; apple<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
<span class="linenr">22: </span>        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">1</span>;
<span class="linenr">23: </span>    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #bc6ec5;">{</span>
<span class="linenr">24: </span>        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span class="linenr">25: </span>    <span style="color: #bc6ec5;">}</span>
<span class="linenr">26: </span><span style="color: #4f97d7;">}</span>
<span class="linenr">27: </span>
<span class="linenr">28: </span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">HasAppleOrPineapple</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">value</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
<span class="linenr">29: </span>    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>value &amp; <span style="color: #2d9574;">(</span>apple | pineapple<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
<span class="linenr">30: </span>        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">1</span>;
<span class="linenr">31: </span>    <span style="color: #bc6ec5;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #bc6ec5;">{</span>
<span class="linenr">32: </span>        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span class="linenr">33: </span>    <span style="color: #bc6ec5;">}</span>
<span class="linenr">34: </span><span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdac1017" class="outline-2">
<h2 id="orgdac1017">問7</h2>
<div class="outline-text-2" id="text-orgdac1017">
<p>
   以下のプログラムに下記の変更を加えよ。<br />
（１）学年により生徒数が決まるので、学年で判断して生徒数を設定する関数を作成する。<br />
（２）各科目情報(講師名、学年、生徒数)をコンソールに出力する関数を作成する。<br />
（３）（２）で作成した関数を変更し、担当講師が松村の場合のみ科目情報をコンソールに出力するようにする。<br />
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #4f97d7; font-weight: bold;">enum</span> <span style="color: #ce537a; font-weight: bold;">TeacherType</span> <span style="color: #4f97d7;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #7590db;">TEACHER_MR_MATSUMURA</span>,
<span class="linenr"> 3: </span>    <span style="color: #ce537a; font-weight: bold;">TEACHER_MR_NAKACHI</span>,
<span class="linenr"> 4: </span>    <span style="color: #7590db;">TEACHER_MR_NAGASAWA</span>
<span class="linenr"> 5: </span><span style="color: #4f97d7;">}</span>;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #2aa1ae; background-color: #292e34;">/** </span><span style="color: #2aa1ae; background-color: #292e34;">&#35611;&#24107;&#24773;&#22577; </span><span style="color: #2aa1ae; background-color: #292e34;">*/</span>
<span class="linenr"> 8: </span><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Teacher</span> <span style="color: #4f97d7;">{</span>
<span class="linenr"> 9: </span>    <span style="color: #4f97d7; font-weight: bold;">enum</span> <span style="color: #ce537a; font-weight: bold;">TeacherType</span> <span style="color: #7590db;">teacherType</span>;
<span class="linenr">10: </span>    <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #ce537a; font-weight: bold;">char</span>* <span style="color: #7590db;">name</span>;
<span class="linenr">11: </span><span style="color: #4f97d7;">}</span>;
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #2aa1ae; background-color: #292e34;">/** </span><span style="color: #2aa1ae; background-color: #292e34;">&#31185;&#30446; </span><span style="color: #2aa1ae; background-color: #292e34;">*/</span>
<span class="linenr">14: </span><span style="color: #4f97d7; font-weight: bold;">typedef</span> <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #4f97d7;">{</span>
<span class="linenr">15: </span>    <span style="color: #2aa1ae; background-color: #292e34;">/** </span><span style="color: #2aa1ae; background-color: #292e34;">&#25285;&#24403;&#35611;&#24107; </span><span style="color: #2aa1ae; background-color: #292e34;">*/</span>
<span class="linenr">16: </span>    <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Teacher</span> <span style="color: #7590db;">teacher</span>;
<span class="linenr">17: </span>    <span style="color: #2aa1ae; background-color: #292e34;">/** </span><span style="color: #2aa1ae; background-color: #292e34;">&#23398;&#24180; </span><span style="color: #2aa1ae; background-color: #292e34;">*/</span>
<span class="linenr">18: </span>    <span style="color: #ce537a; font-weight: bold;">unsigned</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">grade</span>;
<span class="linenr">19: </span>    <span style="color: #2aa1ae; background-color: #292e34;">/** </span><span style="color: #2aa1ae; background-color: #292e34;">&#29983;&#24466;&#25968; </span><span style="color: #2aa1ae; background-color: #292e34;">*/</span>
<span class="linenr">20: </span>    <span style="color: #ce537a; font-weight: bold;">unsigned</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">studentCount</span>;
<span class="linenr">21: </span><span style="color: #4f97d7;">}</span> <span style="color: #ce537a; font-weight: bold;">Subject</span>;
<span class="linenr">22: </span>
<span class="linenr">23: </span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
<span class="linenr">24: </span>    <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Teacher</span> <span style="color: #7590db;">mrMatsumura</span>;
<span class="linenr">25: </span>    mrMatsumura.teacherType = TEACHER_MR_MATSUMURA;
<span class="linenr">26: </span>    mrMatsumura.name = <span style="color: #2d9574;">"&#26494;&#26449;"</span>;
<span class="linenr">27: </span>
<span class="linenr">28: </span>    <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Teacher</span> <span style="color: #7590db;">mrNakachi</span>;
<span class="linenr">29: </span>    mrNakachi.teacherType = TEACHER_MR_NAKACHI;
<span class="linenr">30: </span>    mrNakachi.name = <span style="color: #2d9574;">"&#20013;&#22320;"</span>;
<span class="linenr">31: </span>
<span class="linenr">32: </span>    <span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Teacher</span> <span style="color: #7590db;">mrNagasawa</span>;
<span class="linenr">33: </span>    mrNagasawa.teacherType = TEACHER_MR_NAGASAWA;
<span class="linenr">34: </span>    mrNagasawa.name = <span style="color: #2d9574;">"&#38263;&#28580;"</span>;
<span class="linenr">35: </span>
<span class="linenr">36: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#12503;&#12525;&#12464;&#12521;&#12512;&#22522;&#30990;1</span>
<span class="linenr">37: </span>    <span style="color: #ce537a; font-weight: bold;">Subject</span> <span style="color: #7590db;">programBase1</span>;
<span class="linenr">38: </span>    programBase1.teacher = mrMatsumura;
<span class="linenr">39: </span>    programBase1.grade = <span style="color: #a45bad;">1</span>;
<span class="linenr">40: </span>    programBase1.studentCount = <span style="color: #a45bad;">16</span>;
<span class="linenr">41: </span>
<span class="linenr">42: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#25285;&#20219;&#12476;&#12511;1</span>
<span class="linenr">43: </span>    <span style="color: #ce537a; font-weight: bold;">Subject</span> <span style="color: #7590db;">seminar1</span>;
<span class="linenr">44: </span>    seminar1.teacher = mrNagasawa;
<span class="linenr">45: </span>    seminar1.grade = <span style="color: #a45bad;">1</span>;
<span class="linenr">46: </span>    seminar1.studentCount = <span style="color: #a45bad;">16</span>;
<span class="linenr">47: </span>
<span class="linenr">48: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#12503;&#12525;&#12464;&#12521;&#12512;&#29702;&#35542;2</span>
<span class="linenr">49: </span>    <span style="color: #ce537a; font-weight: bold;">Subject</span> <span style="color: #7590db;">programTheory2</span>;
<span class="linenr">50: </span>    programTheory2.teacher = mrMatsumura;
<span class="linenr">51: </span>    programTheory2.grade = <span style="color: #a45bad;">2</span>;
<span class="linenr">52: </span>    programTheory2.studentCount = <span style="color: #a45bad;">14</span>;
<span class="linenr">53: </span>
<span class="linenr">54: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#12466;&#12540;&#12512;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;2</span>
<span class="linenr">55: </span>    <span style="color: #ce537a; font-weight: bold;">Subject</span> <span style="color: #7590db;">gameProgramming2</span>;
<span class="linenr">56: </span>    gameProgramming2.teacher = mrNakachi;
<span class="linenr">57: </span>    gameProgramming2.grade = <span style="color: #a45bad;">2</span>;
<span class="linenr">58: </span>    gameProgramming2.studentCount = <span style="color: #a45bad;">14</span>;
<span class="linenr">59: </span><span style="color: #4f97d7;">}</span>
<span class="linenr">60: </span>
<span class="linenr">61: </span><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">SetStudentCount</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Subject</span>* <span style="color: #7590db;">pSubject</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
<span class="linenr">62: </span>    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#12371;&#12371;&#12434;&#20316;&#12387;&#12390;&#12418;&#12425;&#12358;</span>
<span class="linenr">63: </span><span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2983e7e" class="outline-2">
<h2 id="org2983e7e">問8</h2>
<div class="outline-text-2" id="text-org2983e7e">
<p>
   以下のプログラムに下記の変更を加えよ。<br />
（１）構造体をクラスに変更する。<br />
（２）メンバ変数をencapsulateし、accessor methodを用いてアクセスするよう変更する。<br />
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="linenr"> 1: </span><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #4f97d7; font-weight: bold;">struct</span> <span style="color: #ce537a; font-weight: bold;">Player</span> <span style="color: #4f97d7;">{</span>
<span class="linenr"> 4: </span>    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">hp</span>;
<span class="linenr"> 5: </span>    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">mp</span>;
<span class="linenr"> 6: </span><span style="color: #4f97d7;">}</span>;
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
<span class="linenr"> 9: </span>    <span style="color: #ce537a; font-weight: bold;">Player</span> <span style="color: #7590db;">player</span>;
<span class="linenr">10: </span>    player.hp = <span style="color: #a45bad;">100</span>;
<span class="linenr">11: </span>    player.mp = <span style="color: #a45bad;">25</span>;
<span class="linenr">12: </span>
<span class="linenr">13: </span>    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"hp = %d, mp = %d\n"</span>, player.hp, player.mp<span style="color: #bc6ec5;">)</span>;
<span class="linenr">14: </span>
<span class="linenr">15: </span>    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span class="linenr">16: </span><span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
